tap "bramstein/webfonttools"
tap "buildpacks/tap"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "rbenv/tap"
tap "universal-ctags/universal-ctags"

brew "ack"
brew "ansible-lint"
brew "autojump"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "pkg-config"
brew "cksfv"
brew "clamav"
brew "cmake"
brew "lame"
brew "ffmpeg"
brew "cmus"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "direnv"
brew "findutils"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grc"
brew "grep"
brew "hstr"
brew "htop"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "jack"
brew "jq"
brew "kubernetes-cli"
brew "ldns"
brew "lftp"
brew "pango"
brew "lua"
brew "lynx"
brew "mas"
brew "moc"
brew "moreutils"
brew "neovim"
brew "ngrep"
brew "nnn"
brew "node"
brew "openjdk"
brew "openssh"
brew "p7zip"
brew "packer"
brew "pv"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "screenfetch"
brew "ssh-copy-id", link: true
brew "sshs"
brew "terraform"
brew "tmux"
brew "tree"
brew "vbindiff"
brew "vim"
brew "watch"
brew "wget"
brew "wimlib"
brew "woff2"
brew "yarn"
brew "youtube-dl"
brew "zoxide"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "buildpacks/tap/pack"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "fd"
brew "1password-cli"
brew "btop"
brew "alacritty"
brew "zellij"
brew "lazydocker"
brew "lazygit"
brew "m-cli"
brew "iperf3"
brew "f3"

cask "1password"
cask "calibre"
cask "firefox"
cask "jdowloader"
cask "alfred"
cask "angry-ip-scanner"
cask "balenaetcher"
cask "caffeine"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "cyberduck"
cask "flycut"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "java"
cask "keka"
cask "obsidian"
cask "postman"
cask "shiftit"
cask "stats"
cask "espanso"
cask "steam"
cask "transmission"
cask "vlc"
cask "phoenix-slides"
cask "docker"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "tailscale"
cask "openemu"
cask "slack"
cask "skype"
cask "zoom"
cask "sdformatter"

mas "Gemini", id: 463541543
mas "HP Smart", id: 1474276998
mas "Kindle", id: 405399194
mas "NordVPN", id: 905953485
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Things", id: 904280696
mas "WhatsApp", id: 1147396723
