# Adding taps (repos) on top
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "homebrew/cask-fonts"

brew "wget"
brew "fzf"
brew "git"
# yarn requires node
brew "node"
brew "starship"
brew "tmux"
brew "tree"
brew "watch"
brew "stow"

brew "ansible"
brew "ansible-lint"

# karabiner uses yarn to install depencencies
brew "yarn"
brew "zoxide"
# Cat with wings
brew "bat"
# Replacement for ls
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"
cask "wezterm"

brew "jq"


cask "font-meslo-lg-nerd-font"
cask "sf-symbols"
cask "font-jetbrains-mono-nerd-font"

brew "neovim"
brew "gnu-sed"
brew "jesseduffield/lazygit/lazygit"
brew "ripgrep"
brew "fd"

# change macOS audio source from the command-line
brew "switchaudio-osx"

cask "obsidian"
cask "hot"
brew "htop"
brew "neofetch"

cask "microsoft-remote-desktop"

cask "1password"
cask "1password-cli"
cask "calibre"
cask "balenaetcher"
cask "applepi-baker"
cask "sdformatter"
cask "caffeine"
cask "cleanmymac"
cask "cyberduck"
cask "keka"
cask "rar"
cask "obsidian"
cask "tailscale"
cask "vlc"
cask "phoenix-slides"
cask "alfred"

# Browsers
cask "firefox"
cask "tor-browser"
cask "google-chrome"

# Downloads
cask "jdownloader"
cask "transmission"

# Games
cask "steam"
cask "openemu"

# Dev tools
cask "postman"
cask "vagrant"
cask "virtualbox"
cask "docker"
cask "visual-studio-code"
cask "intellij-idea-ce"

# Communication
cask "slack"
cask "skype"
cask "zoom"

# Customizations
cask "aerospace"
brew "sketchybar"

# Terminal
cask "wezterm"