# Adding taps (repos) on top
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "FelixKratz/formulae"
tap "buo/cask-upgrade"

brew "wget"
brew "fzf"
brew "git"
brew "z"

# yarn requires node
brew "node"
brew "starship"
brew "tmux"
brew "tree"
brew "watch"
brew "stow"
brew "sesh"
brew "gum"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

brew "ansible"
brew "ansible-lint"

# karabiner uses yarn to install depencencies
brew "yarn"
brew "zoxide"
# Cat with wings
brew "bat"
# Replacement for ls
brew "eza"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

brew "jq"
brew "yq" # a lightweight and portable command-line YAML, JSON and XML processor. It uses jq underneath.
brew "gh" # github cli. Required by sketchybar


brew "neovim"
brew "gnu-sed"
brew "jesseduffield/lazygit/lazygit"
brew "ripgrep"
brew "fd"
brew "midnight-commander"
brew "iperf3"
brew "lazydocker"
brew "mas"
brew "yazi" # Blazing Fast Terminal File Manager

# change macOS audio source from the command-line. Required by sketchybar
brew "switchaudio-osx"

cask "hot"
brew "btop"
brew "macchina" # system information frontend [https://github.com/Macchina-CLI/macchina]
brew "macmon" if Hardware::CPU.arm? # Mac Usage Monitor in Terminal

# Security
cask "1password"
cask "1password-cli"
cask "tailscale"

# Multimedia
cask "calibre"
cask "vlc"
brew "musikcube" # terminal-based audio player

cask "balenaetcher"
cask "applepi-baker"
cask "raspberry-pi-imager"
cask "sdformatter"
cask "caffeine"
cask "cleanmymac"
cask "cyberduck"
cask "keka"
cask "rar"
cask "obsidian"
cask "phoenix-slides"
cask "raycast"

# Browsers
cask "firefox"
cask "tor-browser"
cask "google-chrome"

# Downloads
cask "jdownloader"
cask "transmission"

# Games
cask "steam"
cask "openemu"
cask "86box"

# Dev tools
cask "postman"
cask "vagrant"
cask "virtualbox"
cask "docker"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "chatgpt" if Hardware::CPU.arm?

# Communication
cask "slack"
cask "skype"
cask "zoom"
cask "discord"

# Customizations
brew "koekeishiya/formulae/yabai"
brew "powerlevel10k"
cask "font-caskaydia-cove-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"

cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "sf-symbols"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-space-mono-nerd-font"

brew "sketchybar"
cask "hammerspoon"
cask "karabiner-elements"
cask "homerow"
cask "bettertouchtool"
brew "m-cli" # Swiss Army Knife for macOS

# Terminal
cask "iterm2"
cask "kitty"
cask "ghostty"

vscode "ms-vscode.cpptools"
vscode "hashicorp.terraform"
vscode "rust-lang.rust-analyzer"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-azuretools.vscode-docker"
vscode "dbaeumer.vscode-eslint"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-vscode.makefile-tools"
vscode "esbenp.prettier-vscode"
vscode "ms-python.vscode-pylance"
vscode "ms-python.python"
vscode "ms-python.debugpy"
vscode "jsjlogin.zxbasic"
vscode "catppuccin.catppuccin-vsc"
vscode "enkia.tokyo-night"

# App Store
mas "Gemini", id: 463541543
mas "HP Smart", id: 1474276998
mas "NordVPN", id: 905953485
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Things", id: 904280696
mas "WhatsApp", id: 310633997
mas "Infuse", id: 1136220934
mas "Windows App", id: 1295203466 # Former Microsgot Remote desktop